Nopro263/circuitpython/ports/raspberrypi/boards/orpheus_pico/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2021 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

#define MICROPY_HW_BOARD_NAME "Orpheus Pico"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO25)
#define MICROPY_HW_LED_STATUS (&pin_GPIO23)
#define CIRCUITPY_SAVES_PARTITION_SIZE 1024
